USER_GREETING = (
    "Здравствуйте, {message.from_user.first_name}!!!\n"
    "Я бот, упрощающий получение расписания занятий ЧГУ"
)

ADMIN_GREETING = (
    "Здравствуйте, {message.from_user.first_name}!!!\n"
    "Я бот, упрощающий получение расписания занятий ЧГУ"
    "\nС повышением!!!"
)

CHOICE_POST_TYPE = "Выберите тип поста"

GET_POST_TEXT = "Введите текст для поста"

GET_POST_PHOTO = "Отправьте мне фото для поста"

ALL_USERS_HAVE_BEEN_ANNOUNCED = "Все пользователи оповещены"

CHOICE_DATE = "Выберите, на какую дату хотите получить расписание"

GET_GROUP_NAME = "Введите название группы"

WRONG_GROUP_NAME = "Такой группы нет.\nПроверьте введённые данные"

DONT_BREAK_ME = "Не ломайте меня, пожалуйста🙏"

RANGE_LENGTH_EXCEEDED = (
    "Вы ввели слишком большой диапазон. "
    "Максимальная длина диапазона "
    "не должна превышать 31 дня. "
    "(Выберите другой день на клавиатуре)"
)



